using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace WebApplicationDiplom.Enumeration
{
    public enum GroundsForDismissal
    {
        Нарушениеп_правил_по_охране_труда_и_технике_безопасности_повлекшее_увечье_или_смерть_другого_работника,
        Истечение_срока_трудового_договора,
        Смерть_работника,
        Отставка,
        Грубое_нарушение_должностных_обязанностей,
        Совершение_проступка_несовместимого_с_нахождением_на_государственной_службе,
        Прекращение_трудового_договора_с_руководителем_организации_по_его_инициативе_досрочно,
        Прием_на_работу_работника_для_которого_данная_работа_будет_являться_основной,
        Вступление_в_законную_силу_обвинительного_приговора_суда,
        Смерть_нанимателя_физического_лица,
        Признание_его_судом_безвестно_отсутствующим,
        Объявление_работника_умершим,
    }
}
